import { FC } from "react";
import styles from "../styles/Form.module.css";

const Reference: FC = () => {

    return (
        <div className={styles.conteiner}>
            <div className={styles.referenceConteiner}>
                <h1 className={styles.referenceMainTitle}>Довідка</h1>

                <h2 className={styles.referenceTitle}>☆ Якщо ви не знаєте, як правильно заповнити поля, натисніть на кнопку "?" у верхньому правому куті блоку. Там ви знайдете детальну інформацію щодо валідації полів.</h2>

                <h2 className={styles.referenceTitle}>☆ Якщо після ваших дій інформація не оновилася, натисніть кнопку "Оновити" (якщо така є) або спробуйте перезавантажити сторінку.</h2>

                <h2 className={styles.referenceTitle}>☆ Інформація про відгуки може відображатися з затримкою до 30 хвилин.</h2>

                <h2 className={styles.referenceTitle}>☆ Часте оновлення інформації, особливо в робочий час, не рекомендується. Хоча це можливо, такі дії можуть призвести до очищення кешу програми, що іноді викликає помилки у клієнтів.</h2>

                <h2 className={styles.referenceTitle}>☆ Якщо бот не відправляє повідомлення в робочий чат, ви можете перевірити це, надіславши запит на консультацію зі свого акаунту. У робочому чаті виконайте команду «/chatid», і бот відповість повідомленням, в якому буде вказано "Telegram chat ID: «ID»". Цю інформацію можна використати для зміни Telegram chat ID магазину в адмін панелі.</h2>

                <h2 className={styles.referenceTitle}>☆ Якщо ви забули пароль від свого аккаунту, будь ласка, зверніться до адміністратора для отримання допомоги. Він зможе допомогти вам скинути пароль або відновити доступ до вашого облікового запису.</h2>

                <h2 className={styles.referenceTitle}>☆ Послідовність для первинного налаштування</h2>
                <h3 className={styles.referenceText}>Спочатку необхідно додати «Місто» ➜ «Магазин» ➜ «Адміністратор». Після цього слід внести всі товари (цей процес виконується один раз), а потім для кожного магазину окремо потрібно визначити, які товари будуть доступні для продажу, а які — ні (Рекомендується додати перше місто, магазин, адміністратора та товари до реєстрації першого користувача).</h3>

                <h2 className={styles.referenceTitle}>☆ Послідовність для створення тг чату магазину</h2>
                <h3 className={styles.referenceText}>Спочатку необхідно створити нову приватну групу в телеграм ➜ додати бот як адміністратора (Не можна змінювати назву ролі і робити групу публічною так як телеграм може почати інколи змінювати Chat ID цього каналу, і не питайте мене чому це, я сам хз і ніде інформації немає, просто прийміть це як факт😅). Піля додавання боту ви зможете виконати команду «/chatid» і бот відповість повідомленням, в якому буде вказано "Telegram chat ID: «ID»". Цю інформацію можна використати для додавання Telegram chat ID магазину в адмін панелі.</h3>

                <h2 className={styles.referenceTitle}>☆ Зверніть увагу:</h2>
                <h3 className={styles.referenceText}>Якщо ви видалите «Місто», каскадно будуть видалені всі пов'язані магазини, адміністратори та списоки товарів, доступних для продажу в цих магазинах.  </h3>
                <h3 className={styles.referenceText}></h3>
                <h3 className={styles.referenceText}>Видалення «Магазин» призведе до видалення адміністратора та списку товарів, доступних для продажу в цьому магазині.</h3>
                <h3 className={styles.referenceText}></h3>
                <h3 className={styles.referenceText}>Адміністратора можна видалити без втрати даних, і в такому випадку потрібно буде призначити нового адміністратора для цього магазину (кожен магазин може мати лише одного адміністратора).</h3>
                <h3 className={styles.referenceText}></h3>
                <h3 className={styles.referenceText}>Основний список товарів залишається незалежним!</h3>
            </div>
        </div>
    );
}

export default Reference;